##########################################################
# variable 設定
##########################################################
# 変数
variable "project" {}
variable "env" {}
variable "cidr" {}

######################################################################
# VPC 設定
######################################################################

# AWS上にVPCを構築
resource "aws_vpc" "vpc" {

  # ネットワークの範囲を設定
  cidr_block = var.cidr

  # DNSサポートを有効化
  enable_dns_support = "true"

  # DNSホスト名を有効化
  enable_dns_hostnames = "true"

  # タグを設定
  tags = {
    Name = "${var.project}-vpc-${var.env}"
  }
}

######################################################################
# output 設定
######################################################################
output "vpc_id" {
  value = aws_vpc.vpc.id
}